# Sample pipelining with Pandas using `pdpipe`
#### David Sotunbo, Data Scientist

In [0]:
!pip install pdpipe
import pandas as pd
import numpy as np
import pdpipe as pdp

Requirement already satisfied: pdpipe in /usr/local/lib/python3.6/dist-packages (0.0.33)
Requirement already satisfied: pandas>=0.18.0 in /usr/local/lib/python3.6/dist-packages (from pdpipe) (0.25.3)
Requirement already satisfied: tqdm in /usr/local/lib/python3.6/dist-packages (from pdpipe) (4.28.1)
Requirement already satisfied: skutil>=0.0.15 in /usr/local/lib/python3.6/dist-packages (from pdpipe) (0.0.16)
Requirement already satisfied: sortedcontainers in /usr/local/lib/python3.6/dist-packages (from pdpipe) (2.1.0)
Requirement already satisfied: strct in /usr/local/lib/python3.6/dist-packages (from pdpipe) (0.0.30)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.18.0->pdpipe) (1.17.4)
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.18.0->pdpipe) (2.6.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.18.0->pdpipe) (2018.9)
Requirement already satisfied: decore in /usr/local/lib/python3.6/dist-packages (from skutil>=0.0.15->pdpipe) (0.0.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas>=0.18.0->pdpipe) (1.12.0)

In [0]:
df = pd.read_csv("train.csv")

In [0]:
round(df.sample(5),2)

     PassengerId  Survived  Pclass  ...    Fare Cabin  Embarked
522          523         0       3  ...    7.22   NaN         C
330          331         1       3  ...   23.25   NaN         Q
708          709         1       1  ...  151.55   NaN         S
38            39         0       3  ...   18.00   NaN         S
192          193         1       3  ...    7.85   NaN         S

[5 rows x 12 columns]

In [0]:
df.shape

(891, 12)

In [0]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [0]:
round(df.describe().T,2)

             count    mean     std   min     25%     50%    75%     max
PassengerId  891.0  446.00  257.35  1.00  223.50  446.00  668.5  891.00
Survived     891.0    0.38    0.49  0.00    0.00    0.00    1.0    1.00
Pclass       891.0    2.31    0.84  1.00    2.00    3.00    3.0    3.00
Age          714.0   29.70   14.53  0.42   20.12   28.00   38.0   80.00
SibSp        891.0    0.52    1.10  0.00    0.00    0.00    1.0    8.00
Parch        891.0    0.38    0.81  0.00    0.00    0.00    0.0    6.00
Fare         891.0   32.20   49.69  0.00    7.91   14.45   31.0  512.33

In [0]:
def size(n):
    if n<=18:
        return 'Child'
    elif 18<n<=59:
        return 'Adult'
    else:
        return 'Old'

df['Age_bracket']=df['Age'].apply(size)

In [0]:
round(df.sample(5),2)

     PassengerId  Survived  Pclass  ... Cabin Embarked  Age_bracket
480          481         0       3  ...   NaN        S        Child
760          761         0       3  ...   NaN        S          Old
568          569         0       3  ...   NaN        C          Old
368          369         1       3  ...   NaN        Q          Old
234          235         0       2  ...   NaN        S        Adult

[5 rows x 13 columns]

### Drop a column

In [0]:
drop_age = pdp.ColDrop('Ticket')

In [0]:
df2 = drop_age(df)

In [0]:
round(df2.sample(5))

     PassengerId  Survived  Pclass  ... Cabin Embarked  Age_bracket
402          403         0       3  ...   NaN        S        Adult
777          778         1       3  ...   NaN        S        Child
807          808         0       3  ...   NaN        S        Child
262          263         0       1  ...   E67        S        Adult
611          612         0       3  ...   NaN        S          Old

[5 rows x 12 columns]

### Chaining stages by adding them up

In [0]:
pipeline = pdp.ColDrop('Ticket')
pipeline+= pdp.OneHotEncode('Age_bracket')

In [0]:
df3 = pipeline(df)

In [0]:
round(df3.sample(5))

     PassengerId  Survived  Pclass  ... Embarked Age_bracket_Child  Age_bracket_Old
197          198         0       3  ...        S                 0                0
432          433         1       2  ...        S                 0                0
759          760         1       1  ...        S                 0                0
774          775         1       2  ...        S                 0                0
336          337         0       1  ...        S                 0                0

[5 rows x 13 columns]

In [0]:
df['Fare'].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [0]:
def fare_range(x):
    if x>7:
        return 'keep'
    else:
        return 'drop'

In [0]:
pipeline = pdp.ColDrop('Ticket')
pipeline+= pdp.OneHotEncode('Age_bracket')
pipeline+=pdp.ApplyByCols('Fare',fare_range,'Fare_range',drop=False)

In [0]:
df4 = pipeline(df)

In [0]:
df4.shape

(891, 14)

In [0]:
round(df4.sample(5),2)

     PassengerId  Survived  Pclass  ... Embarked Age_bracket_Child  Age_bracket_Old
784          785         0       3  ...        S                 0                0
711          712         0       1  ...        S                 0                1
836          837         0       3  ...        S                 0                0
340          341         1       2  ...        S                 1                0
603          604         0       3  ...        S                 0                0

[5 rows x 14 columns]

In [0]:
df4.Fare_range.unique()

array(['keep', 'drop'], dtype=object)

In [0]:
pipeline = pdp.ColDrop('Ticket')
pipeline+= pdp.OneHotEncode('Age_bracket','Sex')
pipeline+=pdp.ApplyByCols('Fare',fare_range,'Fare_range',drop=False)
pipeline+=pdp.ValDrop(['drop'],'Fare_range')
pipeline+= pdp.ColDrop(['Fare','Sex','Cabin'])

In [0]:
df5 = pipeline(df)

In [0]:
df5.dtypes

PassengerId            int64
Survived               int64
Pclass                 int64
Name                  object
Age                  float64
SibSp                  int64
Parch                  int64
Fare_range            object
Embarked              object
Age_bracket_Adult      uint8
Age_bracket_Child      uint8
Age_bracket_Old        uint8
dtype: object

### Scikit-learn scaling

In [0]:
pipeline_scale = pdp.Scale('StandardScaler',exclude_columns=['Name','Fare_range','Embarked'])

In [0]:
df6 = pipeline_scale(df5)

In [0]:
round(df6.sample(5),3)

     PassengerId  Survived  ...  Age_bracket_Child Age_bracket_Old
543        0.390     1.240  ...             -0.434          -0.535
377       -0.255    -0.806  ...             -0.434          -0.535
198       -0.951     1.240  ...             -0.434           1.869
652        0.814    -0.806  ...             -0.434          -0.535
112       -1.286    -0.806  ...             -0.434          -0.535

[5 rows x 12 columns]

### NLTK stages

In [0]:
pipeline_tokenize=pdp.TokenizeWords('Name')

In [0]:
df7 = pipeline_tokenize(df6)

In [0]:
df7.sample(5)

     PassengerId  Survived  ...  Age_bracket_Child Age_bracket_Old
328    -0.445711  1.240256  ...          -0.434402       -0.534921
848     1.576217 -0.806285  ...          -0.434402       -0.534921
304    -0.539030 -0.806285  ...          -0.434402        1.869436
783     1.323476 -0.806285  ...          -0.434402        1.869436
885     1.720084 -0.806285  ...          -0.434402       -0.534921

[5 rows x 12 columns]

In [0]:
def extract_state(token):
    return str(token[-3:])

In [0]:
pipeline_state = pdp.ApplyByCols('Name',extract_state,result_columns='Name_token')

In [0]:
df8=pipeline_state(df7)

In [0]:
round(df8.sample(5),3)

     PassengerId  Survived  ...  Age_bracket_Child Age_bracket_Old
182       -1.013    -0.806  ...              2.302          -0.535
316       -0.492     1.240  ...             -0.434          -0.535
797        1.378     1.240  ...             -0.434          -0.535
303       -0.543     1.240  ...             -0.434           1.869
354       -0.345    -0.806  ...             -0.434           1.869

[5 rows x 12 columns]